Tekla Open API Reference for Tekla Structures 2025
TeklaStructuresFiles.PropertyFileDirectories Property
 The directories where to look for property files.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public List<string> PropertyFileDirectories { get; set; }
Public Property PropertyFileDirectories As List(Of String)
	Get
	Set
Property Value
Type: List<String>
See Also
Reference
TeklaStructuresFiles Class
Tekla.Structures Namespace